; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph4 - mode
	thermograph2 - mode
	image3 - mode
	infrared0 - mode
	infrared1 - mode
	groundstation4 - direction
	star0 - direction
	star3 - direction
	groundstation1 - direction
	groundstation2 - direction
	planet5 - direction
	star6 - direction
	star7 - direction
	planet8 - direction
	star9 - direction
	phenomenon10 - direction
	phenomenon11 - direction
	phenomenon12 - direction
	star13 - direction
	star14 - direction
	phenomenon15 - direction
	planet16 - direction
	star17 - direction
	star18 - direction
	planet19 - direction
	phenomenon20 - direction
	planet21 - direction
	planet22 - direction
	star23 - direction
	star24 - direction
	planet25 - direction
	phenomenon26 - direction
	phenomenon27 - direction
	star28 - direction
)
(:init
	(supports instrument0 thermograph4)
	(calibration_target instrument0 groundstation2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 groundstation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet16)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 groundstation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 star0)
	(supports instrument3 image3)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 planet21)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 groundstation1)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 star3)
	(supports instrument6 image3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 groundstation2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet16)
	(supports instrument7 infrared0)
	(supports instrument7 infrared1)
	(supports instrument7 image3)
	(calibration_target instrument7 groundstation1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 groundstation2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 groundstation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 star13)
)
(:goal (and
	(pointing satellite2 groundstation4)
	(pointing satellite3 star23)
	(have_image planet5 thermograph4)
	(have_image star6 infrared0)
	(have_image star7 infrared0)
	(have_image planet8 thermograph4)
	(have_image star9 image3)
	(have_image phenomenon10 thermograph2)
	(have_image phenomenon11 image3)
	(have_image phenomenon12 infrared0)
	(have_image star13 infrared1)
	(have_image star14 image3)
	(have_image phenomenon15 infrared0)
	(have_image planet16 image3)
	(have_image star17 image3)
	(have_image star18 image3)
	(have_image phenomenon20 infrared0)
	(have_image planet21 thermograph4)
	(have_image planet22 infrared1)
	(have_image star23 thermograph4)
	(have_image star24 infrared1)
	(have_image planet25 thermograph4)
	(have_image phenomenon26 image3)
	(have_image phenomenon27 image3)
	(have_image star28 thermograph2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 25
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 25
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 25
4. (turn_to satellite4 groundstation1 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 25
5. (calibrate satellite4 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 25
6. (turn_to satellite4 phenomenon11 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 25
7. (take_image satellite4 phenomenon11 instrument7 image3)
   added: (have_image phenomenon11 image3)
   goals met: 1 of 25
8. (turn_to satellite4 phenomenon12 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 25
9. (take_image satellite4 phenomenon12 instrument7 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 2 of 25
10. (turn_to satellite4 phenomenon15 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon15)
   goals met: 2 of 25
11. (take_image satellite4 phenomenon15 instrument7 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 3 of 25
12. (turn_to satellite4 phenomenon20 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon20)
   goals met: 3 of 25
13. (take_image satellite4 phenomenon20 instrument7 infrared0)
   added: (have_image phenomenon20 infrared0)
   goals met: 4 of 25
14. (turn_to satellite4 phenomenon26 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon26)
   goals met: 4 of 25
15. (take_image satellite4 phenomenon26 instrument7 image3)
   added: (have_image phenomenon26 image3)
   goals met: 5 of 25
16. (turn_to satellite4 phenomenon27 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 phenomenon27)
   goals met: 5 of 25
17. (take_image satellite4 phenomenon27 instrument7 image3)
   added: (have_image phenomenon27 image3)
   goals met: 6 of 25
18. (turn_to satellite4 planet16 phenomenon27)
   deleted: (pointing satellite4 phenomenon27)
   added: (pointing satellite4 planet16)
   goals met: 6 of 25
19. (take_image satellite4 planet16 instrument7 image3)
   added: (have_image planet16 image3)
   goals met: 7 of 25
20. (turn_to satellite4 planet22 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet22)
   goals met: 7 of 25
21. (take_image satellite4 planet22 instrument7 infrared1)
   added: (have_image planet22 infrared1)
   goals met: 8 of 25
22. (turn_to satellite4 star13 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star13)
   goals met: 8 of 25
23. (take_image satellite4 star13 instrument7 infrared1)
   added: (have_image star13 infrared1)
   goals met: 9 of 25
24. (turn_to satellite4 star14 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star14)
   goals met: 9 of 25
25. (take_image satellite4 star14 instrument7 image3)
   added: (have_image star14 image3)
   goals met: 10 of 25
26. (turn_to satellite4 star17 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star17)
   goals met: 10 of 25
27. (take_image satellite4 star17 instrument7 image3)
   added: (have_image star17 image3)
   goals met: 11 of 25
28. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 11 of 25
29. (take_image satellite4 star18 instrument7 image3)
   added: (have_image star18 image3)
   goals met: 12 of 25
30. (turn_to satellite4 star24 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star24)
   goals met: 12 of 25
31. (take_image satellite4 star24 instrument7 infrared1)
   added: (have_image star24 infrared1)
   goals met: 13 of 25
32. (turn_to satellite4 star6 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star6)
   goals met: 13 of 25
33. (take_image satellite4 star6 instrument7 infrared0)
   added: (have_image star6 infrared0)
   goals met: 14 of 25
34. (turn_to satellite4 star7 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star7)
   goals met: 14 of 25
35. (take_image satellite4 star7 instrument7 infrared0)
   added: (have_image star7 infrared0)
   goals met: 15 of 25
36. (turn_to satellite4 star9 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star9)
   goals met: 15 of 25
37. (take_image satellite4 star9 instrument7 image3)
   added: (have_image star9 image3)
   goals met: 16 of 25
38. (turn_to satellite3 star23 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 star23)
   goals met: 17 of 25
39. (turn_to satellite0 groundstation2 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation2)
   goals met: 17 of 25
40. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 17 of 25
41. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 17 of 25
42. (take_image satellite0 phenomenon10 instrument1 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 18 of 25
43. (turn_to satellite0 star28 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star28)
   goals met: 18 of 25
44. (take_image satellite0 star28 instrument1 thermograph2)
   added: (have_image star28 thermograph2)
   goals met: 19 of 25
45. (turn_to satellite2 star0 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 star0)
   goals met: 19 of 25
46. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 19 of 25
47. (turn_to satellite2 groundstation4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation4)
   goals met: 20 of 25
48. (turn_to satellite2 planet25 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet25)
   goals met: 19 of 25
49. (take_image satellite2 planet25 instrument3 thermograph4)
   added: (have_image planet25 thermograph4)
   goals met: 20 of 25
50. (turn_to satellite2 groundstation4 planet25)
   deleted: (pointing satellite2 planet25)
   added: (pointing satellite2 groundstation4)
   goals met: 21 of 25
51. (turn_to satellite2 planet5 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet5)
   goals met: 20 of 25
52. (take_image satellite2 planet5 instrument3 thermograph4)
   added: (have_image planet5 thermograph4)
   goals met: 21 of 25
53. (turn_to satellite2 groundstation4 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation4)
   goals met: 22 of 25
54. (turn_to satellite2 planet8 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet8)
   goals met: 21 of 25
55. (take_image satellite2 planet8 instrument3 thermograph4)
   added: (have_image planet8 thermograph4)
   goals met: 22 of 25
56. (turn_to satellite2 groundstation4 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation4)
   goals met: 23 of 25
57. (turn_to satellite2 star23 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star23)
   goals met: 22 of 25
58. (take_image satellite2 star23 instrument3 thermograph4)
   added: (have_image star23 thermograph4)
   goals met: 23 of 25
59. (turn_to satellite2 groundstation4 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 groundstation4)
   goals met: 24 of 25
60. (turn_to satellite2 planet21 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet21)
   goals met: 23 of 25
61. (take_image satellite2 planet21 instrument3 thermograph4)
   added: (have_image planet21 thermograph4)
   goals met: 24 of 25
62. (turn_to satellite2 groundstation4 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 groundstation4)
   goals met: 25 of 25
